In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import progressbar

In [75]:
cnter = 0
n_users = 99
bar = progressbar.ProgressBar(maxval=n_users+1, widgets=[progressbar.Bar('=', '[', ']'), ' ', progressbar.Percentage()])
bar.start()

[                                                                        ] N/A%

In [76]:
df = pd.DataFrame({
    "A": [1, 3] * 3,
    "B": ['a', 'b', np.nan, 'd', 'f', 20],
    "C": [np.nan, 10, np.nan, 14, 35, 'c'],
    "D": [12, 10, 2, 14, 35, 'c'],
    "E": [2, 45, 68, np.nan, 35, np.nan]
})

In [77]:
df

   A    B    C   D     E
0  1    a  NaN  12   2.0
1  3    b   10  10  45.0
2  1  NaN  NaN   2  68.0
3  3    d   14  14   NaN
4  1    f   35  35  35.0
5  3   20    c   c   NaN

In [78]:
df.groupby(['B'])['A'].value_counts().unstack()

A     1    3
B
20  NaN  1.0
a   1.0  NaN
b   NaN  1.0
d   NaN  1.0
f   1.0  NaN

In [79]:
df.groupby(by=['A', 'B'])['C', 'D'].max()

        C   D
A B
1 a   NaN  12
  f    35  35
3 20    c   c
  b    10  10
  d    14  14

In [80]:

df.groupby(by=['A', 'B'])['C'].max().unstack()

B   20    a    b    d    f
A
1  NaN  NaN  NaN  NaN   35
3    c  NaN   10   14  NaN

In [81]:
df.groupby(by=['A', 'B'])['C', 'D'].max().unstack()

     C                        D
B   20    a    b    d    f   20    a    b    d    f
A
1  NaN  NaN  NaN  NaN   35  NaN   12  NaN  NaN   35
3    c  NaN   10   14  NaN    c  NaN   10   14  NaN

In [82]:
df.pivot_table(values=['C', 'D'], index=['A'], columns=['B'], aggfunc=np.max)

     C                   D
B   20    b    d    f   20    a    b    d    f
A
1  NaN  NaN  NaN   35  NaN   12  NaN  NaN   35
3    c   10   14  NaN    c  NaN   10   14  NaN

In [83]:
cnter+=1 
bar.update(cnter)

In [84]:
A = np.array([10,4,6,7,1,5,3,24,9,10,18])
B = np.array([1,8,8,9])

In [85]:
A[np.in1d(A, B)]

array([1, 9])

In [86]:
np.intersect1d(A, B)

array([1, 9])

In [87]:
np.intersect1d(A, B, assume_unique=True)

array([ 1,  8,  9, 10])

In [88]:
np.setdiff1d(A, B, assume_unique=True)

array([10,  4,  6,  7,  5,  3, 24, 10, 18])

In [89]:
cnter+=1 
bar.update(cnter)

[=                                                                       ]   2%

In [90]:
s = 'Documentary|Short'
s.split('|')

['Documentary', 'Short']

In [91]:
s = pd.Series(['a_b_c_f_j', 'c_d_e_f_h', np.nan, 'f_g_h_x_g'])

In [92]:
s

0    a_b_c_f_j
1    c_d_e_f_h
2          NaN
3    f_g_h_x_g
dtype: object

In [93]:
s.str.split('_')

0    [a, b, c, f, j]
1    [c, d, e, f, h]
2                NaN
3    [f, g, h, x, g]
dtype: object

In [94]:
s.str.split('_', expand=True)

     0    1    2    3    4
0    a    b    c    f    j
1    c    d    e    f    h
2  NaN  NaN  NaN  NaN  NaN
3    f    g    h    x    g

In [95]:
cnter+=1 
bar.update(cnter)

[==                                                                      ]   3%

In [96]:
a = np.array([2,4,6,8,10])

In [97]:
np.where(a > 5)

(array([2, 3, 4]),)

In [98]:
np.where(a > 5, 1, -1)

array([-1, -1,  1,  1,  1])

In [99]:
np.argwhere(a > 5)

array([[2],
       [3],
       [4]])

In [100]:
np.argmax(a)

4

In [101]:
np.argmin(a)

0

In [102]:
s = [75.48556738,   9.67425201]

In [103]:
np.diag(s)

array([[75.48556738,  0.        ],
       [ 0.        ,  9.67425201]])

In [104]:
cnter+=1 
bar.update(cnter)

[==                                                                      ]   4%

In [105]:
np.array(df['C'])

array([nan, 10, nan, 14, 35, 'c'], dtype=object)

In [106]:
np.count_nonzero(~np.isnan(np.array(df['E'])))

4

In [107]:
cnter+=1 
bar.update(cnter)

In [108]:
a = np.array([[1,3,6],[9,5,6],[2,2,3]])

In [109]:
a

array([[1, 3, 6],
       [9, 5, 6],
       [2, 2, 3]])

In [110]:
np.matrix(a)

matrix([[1, 3, 6],
        [9, 5, 6],
        [2, 2, 3]])

In [111]:
a.argsort()

array([[0, 1, 2],
       [1, 2, 0],
       [0, 1, 2]])

In [112]:
a.argsort(axis=0)

array([[0, 2, 2],
       [2, 0, 0],
       [1, 1, 1]])

In [113]:
b = [1, 3, 6, 9, 5, 6, 2, 2, 3]

In [114]:
np.argsort(b)

array([0, 6, 7, 1, 8, 4, 2, 5, 3])

In [115]:
np.argsort(b)[::-1]

array([3, 5, 2, 4, 8, 1, 7, 6, 0])

In [116]:
cnter+=1 
bar.update(cnter)

[====                                                                    ]   6%

In [117]:
first = pd.DataFrame({'item_id':['a','b','c','b','d'],'item_price':[1,2,3,2,4]})
second = pd.DataFrame({'item_id':['a','b','f'],'item_atr':['k1','k2','k3']})

In [118]:
first, second

(  item_id  item_price
 0       a           1
 1       b           2
 2       c           3
 3       b           2
 4       d           4,
   item_id item_atr
 0       a       k1
 1       b       k2
 2       f       k3)

In [ ]:
first.merge(second, on=['item_id'])

In [146]:
first.merge(second, on=['item_id'], indicator=True)

  item_id  item_price item_atr _merge
0       a           1       k1   both
1       b           2       k2   both
2       b           2       k2   both

In [145]:
first.merge?

Signature:
first.merge(
    right,
    how='inner',
    on=None,
    left_on=None,
    right_on=None,
    left_index=False,
    right_index=False,
    sort=False,
    suffixes=('_x', '_y'),
    copy=True,
    indicator=False,
    validate=None,
)
Docstring:
Merge DataFrame or named Series objects with a database-style join.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.

Parameters
----------
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : tuple of (str, str), default ('_x', '_y')
    Suffix to apply to overlapping column names in the left and right
    side, respectively. To raise an exception on overlapping columns use
    (False, False).
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to output DataFrame called "_merge" with
    information on the source of each row.
    If string, column with information on source of each row will be added to
    output DataFrame, and column will be named value of string.
    Information column is Categorical-type and takes on a value of "left_only"
    for observations whose merge key only appears in 'left' DataFrame,
    "right_only" for observations whose merge key only appears in 'right'
    DataFrame, and "both" if the observation's merge key is found in both.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

    .. versionadded:: 0.21.0

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------

>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')
File:      ~/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py
Type:      method

In [120]:
pd.concat([first, second])

  item_atr item_id  item_price
0      NaN       a         1.0
1      NaN       b         2.0
2      NaN       c         3.0
3      NaN       b         2.0
4      NaN       d         4.0
0       k1       a         NaN
1       k2       b         NaN
2       k3       f         NaN

In [121]:
pd.concat([first, second], axis=1)

  item_id  item_price item_id item_atr
0       a           1       a       k1
1       b           2       b       k2
2       c           3       f       k3
3       b           2     NaN      NaN
4       d           4     NaN      NaN

In [122]:
pd.concat([first, second], axis=0)

  item_atr item_id  item_price
0      NaN       a         1.0
1      NaN       b         2.0
2      NaN       c         3.0
3      NaN       b         2.0
4      NaN       d         4.0
0       k1       a         NaN
1       k2       b         NaN
2       k3       f         NaN

In [123]:
first.join(second, lsuffix='_caller')

  item_id_caller  item_price item_id item_atr
0              a           1       a       k1
1              b           2       b       k2
2              c           3       f       k3
3              b           2     NaN      NaN
4              d           4     NaN      NaN

In [124]:
second.set_index('item_id')

        item_atr
item_id
a             k1
b             k2
f             k3

In [125]:
first.join(second.set_index('item_id'), on='item_id')

  item_id  item_price item_atr
0       a           1       k1
1       b           2       k2
2       c           3      NaN
3       b           2       k2
4       d           4      NaN

In [126]:
first.merge(second)

  item_id  item_price item_atr
0       a           1       k1
1       b           2       k2
2       b           2       k2

In [127]:
pd.merge(first, second)

  item_id  item_price item_atr
0       a           1       k1
1       b           2       k2
2       b           2       k2

In [128]:
cnter+=1 
bar.update(cnter)

[=====                                                                   ]   7%

In [129]:
round(3.1415926, 3)

3.142

In [130]:
third = pd.DataFrame({
    'column1': [1, 3, 6, 8],
    'column2': ['one', 'two', 'three', 'four'],
    'column3': [{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9', 'reward': 5}, {'amount': 8}, {'offer_id': '2906b810c7d4411798c6938adc9daaa5'}, {'reward': 20}]
})

In [131]:
third.column3

0    {'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...
1                                        {'amount': 8}
2     {'offer_id': '2906b810c7d4411798c6938adc9daaa5'}
3                                       {'reward': 20}
Name: column3, dtype: object

In [132]:
third.column3.apply(pd.Series)

,offer id,reward,amount,offer_id
0,9b98b8c7a33c4b65b9aebfe6a799e6d9,5.0,NaN,NaN
1,NaN,NaN,8.0,NaN
2,NaN,NaN,NaN,2906b810c7d4411798c6938adc9daaa5
3,NaN,20.0,NaN,NaN

In [133]:
cnter+=1 
bar.update(cnter)

[=====                                                                   ]   8%

In [134]:
df = pd.DataFrame({"name": ["a","a","a","b","b","c"], "value": [1,2,3,4,5,6]})
df

  name  value
0    a      1
1    a      2
2    a      3
3    b      4
4    b      5
5    c      6

In [135]:
df['value_shift_down'] = df.groupby('name')['value'].shift()
df

  name  value  value_shift_down
0    a      1               NaN
1    a      2               1.0
2    a      3               2.0
3    b      4               NaN
4    b      5               4.0
5    c      6               NaN

In [136]:
df['value_shift_up'] = df.groupby('name')['value'].shift(-1)
df

  name  value  value_shift_down  value_shift_up
0    a      1               NaN             2.0
1    a      2               1.0             3.0
2    a      3               2.0             NaN
3    b      4               NaN             5.0
4    b      5               4.0             NaN
5    c      6               NaN             NaN

In [137]:
cnter+=1 
bar.update(cnter)

[======                                                                  ]   9%

In [138]:
df = pd.DataFrame({
    "A": [1, 3] * 3,
    "B": ['a', 'b', np.nan, 'd', 'f', 20],
    "C": [np.nan, 10, np.nan, 14, 35, 'c'],
    "D": [12, 10, 2, 14, 35, 'c'],
    "E": [2, 45, 68, np.nan, 35, np.nan]
})
df

   A    B    C   D     E
0  1    a  NaN  12   2.0
1  3    b   10  10  45.0
2  1  NaN  NaN   2  68.0
3  3    d   14  14   NaN
4  1    f   35  35  35.0
5  3   20    c   c   NaN

In [139]:
df.groupby(['A', 'B']).ffill()

   A    B    C   D     E
0  1    a  NaN  12   2.0
1  3    b   10  10  45.0
2  1  NaN  NaN   2  68.0
3  3    d   14  14   NaN
4  1    f   35  35  35.0
5  3   20    c   c   NaN

In [140]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [141]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [142]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

In [143]:
cnter+=1 
bar.update(cnter)

In [144]:
bar.finish()

[========================================================================] 100%